{
  "backend/main.mo": "Main Motoko actor defining data types and CRUD operations for a personal website's resume, blog posts, memories, articles, and study materials, with stable maps and auto-incrementing IDs.",
  "backend/migration.mo": "Migration module that transforms the old actor state to the new shape, seeding a default resume for Bhupesh Chaudhary if none exists.",
  "feature_evidence.json": "Feature evidence report mapping two personalisation features (homepage hero and site-wide identity text for Bhupesh Chaudhary) to their affected files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON catalogue of short summaries for every frontend source file, describing each component, page, hook, and style file's purpose.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point titled 'Personal Website' that mounts the React app into a root div via the Vite module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes (home, resume, blogs, memories, articles, study material) wrapped in the AdminProvider and shared Navigation/Footer layout.",
  "frontend/src/components/admin/AddArticleForm.tsx": "Admin form for creating a new article with title, optional cover image URL, and content fields, using the useCreateArticle mutation.",
  "frontend/src/components/admin/AddBlogPostForm.tsx": "Admin form for publishing a blog post with title, content, and a dynamic tag input, using the useCreateBlogPost mutation.",
  "frontend/src/components/admin/AddMemoryForm.tsx": "Admin form for adding a memory entry with title, description, and image URL fields, using the useAddMemory mutation.",
  "frontend/src/components/admin/AddStudyMaterialForm.tsx": "Admin form for adding study material with title, subject dropdown, description, and content fields, using the useAddStudyMaterial mutation.",
  "frontend/src/components/admin/AdminPanel.tsx": "Tabbed admin panel that consolidates all content management forms (Resume, Blog, Memory, Article, Study Material) in one UI.",
  "frontend/src/components/admin/EditResumeForm.tsx": "A form component for editing resume data (summary, skills, work experience, education) that fetches existing resume data and submits updates via React Query mutations.",
  "frontend/src/components/AdminToggle.tsx": "Modal overlay component with a PIN input form that calls the admin context's toggleAdmin function to unlock admin mode.",
  "frontend/src/components/ArticleCard.tsx": "Clickable article card displaying an optional cover image, publication date, title, and content excerpt with navigation to the full article page.",
  "frontend/src/components/BlogPostCard.tsx": "Clickable blog post card showing publication date, title, content excerpt, and tag badges with navigation to the full post page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the owner's name, tagline, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/MemoryCard.tsx": "Displays a single memory item as a card with an image (or fallback icon), title, and optional description.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with desktop and mobile menus, active-link highlighting, and admin mode controls (login/logout via Settings icon).",
  "frontend/src/components/StudyMaterialCard.tsx": "Card component for a study material item showing a color-coded subject badge, title, and description with click handler support.",
  "frontend/src/components/WorkExperienceTimeline.tsx": "Renders a vertical timeline of work experience entries, each showing position, company, date range, and optional description.",
  "frontend/src/contexts/AdminContext.tsx": "Provides a React context for admin mode, exposing a PIN-based toggle (hardcoded '1234') and an exit function to manage admin state.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data operations including resume, blog posts, memories, articles, and study materials CRUD via the ICP actor.",
  "frontend/src/hooks/useStudyMaterialFilter.ts": "A hook that filters a list of study materials by subject, deriving a sorted unique subject list and the filtered results from the selected subject.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, CSS custom properties for a warm earthy light/dark color palette, and typography using Lora and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ArticlePage.tsx": "A detail page that fetches and renders a single article by ID, showing its cover image, title, date, and paragraph-split content with loading and error states.",
  "frontend/src/pages/ArticlesListingPage.tsx": "A listing page that displays all articles in a responsive grid with loading skeletons, an empty state, and an admin panel when in admin mode.",
  "frontend/src/pages/BlogListingPage.tsx": "Displays a grid of all blog posts fetched via React Query, with loading skeletons, an empty state, and an admin panel shown to admin users.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders a single blog post by ID (from URL params), showing title, publication date, tags, and paragraph-split content, with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Hero landing page for Bhupesh Chaudhary featuring a background image, intro text, and a grid of navigation cards linking to Resume, Blog, Memories, Articles, and Kids' Study sections.",
  "frontend/src/pages/MemoriesPage.tsx": "Displays a masonry-style gallery of memory items fetched via React Query, with loading skeletons, empty state, and an admin panel for admins.",
  "frontend/src/pages/ResumePage.tsx": "Renders the resume page with sections for summary, skills badges, work experience timeline, and education, fetched via React Query, with admin panel support.",
  "frontend/src/pages/StudyMaterialPage.tsx": "Lists study materials in a filterable grid by subject, with a detail dialog on card click, loading skeletons, empty state, and admin panel for admins.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens, serif/sans font families, border radii, box shadows, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 5) for Bhupesh Chaudhary's personal website, listing existing features such as homepage, resume, blogs, memories, articles, and kids' study material sections along with architectural notes and known issues."
}