{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Personalise website for Bhupesh Chaudhary, IAS Officer, Ladakh",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Update homepage hero section to display 'Bhupesh Chaudhary' as an IAS Officer posted in Ladakh with a warm personal introduction",
      "acceptanceCriteria": [
        "The hero section on the homepage displays 'Bhupesh Chaudhary' as the primary heading.",
        "The hero section includes a subtitle or tagline identifying him as an IAS Officer posted in Ladakh.",
        "No generic placeholder names or filler text remain visible in the hero section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the hero section heading and welcome copy to display 'Bhupesh Chaudhary' as the primary name, add a subtitle identifying him as 'IAS Officer, Ladakh', and replace any generic placeholder text with a warm, personal introduction reflecting his identity and role. Ensure the hero maintains its existing background image and CTA button structure."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Update navigation bar, footer, page titles, and Resume page summary to reflect 'Bhupesh Chaudhary' and his role as IAS Officer, Ladakh across all pages",
      "acceptanceCriteria": [
        "The navigation bar displays 'Bhupesh Chaudhary' as the site brand/logo text.",
        "The footer copyright and tagline reference 'Bhupesh Chaudhary'.",
        "The Resume page's summary/about section introduces him as an IAS Officer posted in Ladakh.",
        "No generic or placeholder owner names appear anywhere on the site."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the site brand/logo text in the navigation bar to display 'Bhupesh Chaudhary' instead of any generic placeholder. Maintain all existing navigation links and admin mode controls."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer copyright text and tagline to reference 'Bhupesh Chaudhary' instead of generic placeholder text. Keep the existing year display and caffeine.ai branding link intact."
        },
        {
          "path": "frontend/src/pages/ResumePage.tsx",
          "operation": "modify",
          "description": "Update the Resume page to ensure the summary section (fetched from backend) is displayed prominently and that any page-level title or introduction text identifies the owner as 'Bhupesh Chaudhary, IAS Officer, Ladakh'. If the page has hardcoded intro text separate from the backend summary, update it to reflect his identity."
        }
      ]
    }
  ]
}